АлогистикТест2/src/Documents/алк_РеализацияПродукцииЭкспорт/алк_РеализацияПродукцииЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РеализацияПродукцииЭкспорт</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ТранспортировочныеПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоФактическимПогрузкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыАссортиментныеГруппы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАГ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>750</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыОбъемныеГруппы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОГ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>750</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГ_ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ОперацииСерийныхНомеров/ОперацииСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииСерийныхНомеров</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Движение</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Перевалка</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ЭтапыВыполненияЗаказов/алк_ЭтапыВыполненияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ЭтапыВыполненияЗаказов</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПеревалка</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеТранспортировочнойПартии</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаСудна</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_РеализацияПродукцииЭкспорт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства) Экспорт
		
		СформироватьТаблицаВыполнениеЗаказовЭтапыСерии(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РеализацияПродукцииЭкспортЗапасы.Номенклатура,
		|	алк_РеализацияПродукцииЭкспортЗапасы.Ссылка.Дата КАК ДатаСобытия,
		|	алк_РеализацияПродукцииЭкспортЗапасы.Ссылка.Дата КАК Период,
		|	алк_РеализацияПродукцииЭкспортЗапасы.СерийныйНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Реализация) КАК Операция,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|ИЗ
		|	Документ.алк_РеализацияПродукцииЭкспорт.Запасы КАК алк_РеализацияПродукцииЭкспортЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_РеализацияПродукцииЭкспортЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_РеализацияПродукцииЭкспортЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРеализация);
		РезультатЗапроса = Запрос.Выполнить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", РезультатЗапроса.Выгрузить());
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаВыполнениеЗаказовЭтапыСерии(ДокументСсылкаРеализация, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_РеализацияПродукцииЭкспортЗапасы.Ссылка.Организация,
		|	алк_РеализацияПродукцииЭкспортЗапасы.Номенклатура,
		|	алк_РеализацияПродукцииЭкспортЗапасы.СерийныйНомер,
		|	1 КАК КоличествоПакетов,
		|	&Период,
		|	&ЭтапВыполнения КАК ЭтапВыполненияЗаказа,
		|	алк_РеализацияПродукцииЭкспортЗапасы.Ссылка.Заказ КАК ЗаказПокупателя
		|ИЗ
		|	Документ.алк_РеализацияПродукцииЭкспорт.Запасы КАК алк_РеализацияПродукцииЭкспортЗапасы
		|ГДЕ
		|	алк_РеализацияПродукцииЭкспортЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРеализация);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаРеализация.Дата);
		Запрос.УстановитьПараметр("ЭтапВыполнения", Перечисления.алк_ЭтапыВыполненияЗаказов.Реализация);
		
		РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеЗаказовЭтапыСерии", РезультатЗапроса.Выгрузить());
		
	КонецПроцедуры // СформироватьТаблицаВыполнениеЗаказовЭтапыСерии
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаОтгрузкаРасходников(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_ТранспортировкаЗапасов.ДокументОснование КАК ДокументРН,
		|	алк_ТранспортировкаЗапасов.ДокументыОснования.(
		|		ДокументОснование КАК ДокументОснованиеМультизаказ
		|	),
		|	алк_ТранспортировкаЗапасов.Ссылка КАК ДокументОтгрузки,
		|	&Период
		|ИЗ
		|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
		|ГДЕ
		|	алк_ТранспортировкаЗапасов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировкаЗапасов);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаТранспортировкаЗапасов.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
		
		ВыборкаШапка = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаШапка.Следующий() Цикл
			
			Если ДокументСсылкаТранспортировкаЗапасов.Мультизаказ Тогда
				
				тзРезультат = Новый ТаблицаЗначений;
				тзРезультат.Колонки.Добавить("ДокументРН");
				тзРезультат.Колонки.Добавить("ДокументОтгрузки");
				тзРезультат.Колонки.Добавить("Период");
				
				ВыборкаДокументы = ВыборкаШапка.ДокументыОснования.Выбрать();
				
				Пока ВыборкаДокументы.Следующий() Цикл
					
					НоваяСтрока = тзРезультат.Добавить();
					НоваяСтрока.ДокументРН = ВыборкаДокументы.ДокументОснованиеМультизаказ;
					НоваяСтрока.ДокументОтгрузки = ВыборкаШапка.ДокументОтгрузки;
					НоваяСтрока.Период = ВыборкаШапка.Период;
					
				КонецЦикла; 
				
			Иначе
				
				тзРезультат = РезультатЗапроса.Выгрузить();
				
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		тзРезультат.Свернуть("ДокументРН, ДокументОтгрузки, Период");
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтгрузкаРасходников", тзРезультат);
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	#Область ИнтерфейсПечати
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Инвойс";
		КомандаПечати.Представление = НСтр("ru = 'Инвойс'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "СпецификацияПМ_Англ";
		КомандаПечати.Представление = НСтр("ru = 'Спецификация на английском'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 2;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "СпецификацияПМ_Англ_2";
		КомандаПечати.Представление = НСтр("ru = 'Спецификация на английском (вар.2)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 3;
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Инвойс") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Инвойс", "Инвойс", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "Инвойс"));
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияПМ_Англ") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СпецификацияПМ_Англ", "Спецификация на английском", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СпецификацияПМ_Англ"));
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияПМ_Англ_2") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СпецификацияПМ_Англ_2", "Спецификация на английском (вар.2)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СпецификацияПМ_Англ_2"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "Инвойс" Тогда
				
				СформироватьИнвойс(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			Если ИмяМакета = "СпецификацияПМ_Англ" Тогда
				
				СформироватьСпецификацияАнгл(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			Если ИмяМакета = "СпецификацияПМ_Англ_2" Тогда
				
				СформироватьСпецификацияАнгл_2(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
			
			Возврат ТабличныйДокумент;
			
		КонецЦикла
		
	КонецФункции // ПечатнаяФорма()
	
	// Процедура формирования печатной формы Инвойс
	//
	Процедура СформироватьИнвойс(ТабличныйДокумент, ТекущийДокумент)
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_РеализацияПродукцииЭкспорт.Инвойс");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст = 		
		"ВЫБРАТЬ
		|	алк_РеализацияПродукцииЭкспорт.Дата КАК ДатаДокумента,
		|	алк_РеализацияПродукцииЭкспорт.Номер,
		|	алк_РеализацияПродукцииЭкспорт.Организация.Префикс КАК Префикс,
		|	алк_РеализацияПродукцииЭкспорт.ТоварыОбъемныеГруппы.(
		|		НомерСтроки,
		|		Номенклатура,
		|		ПредставлениеОГ,
		|		Объем,
		|		Цена,
		|		Сумма
		|	),
		|	алк_РеализацияПродукцииЭкспорт.Продавец,
		|	алк_РеализацияПродукцииЭкспорт.Покупатель
		|ИЗ
		|	Документ.алк_РеализацияПродукцииЭкспорт КАК алк_РеализацияПродукцииЭкспорт
		|ГДЕ
		|	алк_РеализацияПродукцииЭкспорт.Ссылка = &ТекущийДокумент";
		
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
		
		НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
		
		ОбластьМакетаШапка.Параметры.Номер = НомерДокумента;
		ОбластьМакетаШапка.Параметры.Дата  = Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
		
		Покупатель = РфпПолучениеДанныхСервер.АнглийскоеНаименованиеАдрес(Шапка.Покупатель);
		ОбластьМакетаШапка.Параметры.Покупатель = Покупатель;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ВыборкаСтрокТовары = Шапка.ТоварыОбъемныеГруппы.Выбрать();
		
		Сумма = 0;
		
		ЕстьДанныеДляВывода = ВыборкаСтрокТовары.Следующий();
		
		Пока ЕстьДанныеДляВывода Цикл
			
			ДанныеСтроки = ВыборкаСтрокТовары;
			
			ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);	
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Сумма = Сумма + ДанныеСтроки.Сумма;
			
			ЕстьДанныеДляВывода = ВыборкаСтрокТовары.Следующий();
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итог");
		ОбластьМакета.Параметры.Сумма = Сумма;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецПроцедуры //СформироватьИнвойс()	
	
	// Процедура формирования печатной формы "Спецификация на английском"
	//
	Процедура СформироватьСпецификацияАнгл(ТабличныйДокумент, ТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РеализацияПродукцииЭкспорт.Номер,
		|	алк_РеализацияПродукцииЭкспорт.Дата,
		|	алк_РеализацияПродукцииЭкспорт.Заказ,
		|	ПРЕДСТАВЛЕНИЕ(алк_РеализацияПродукцииЭкспорт.Заказ)
		|ИЗ
		|	Документ.алк_РеализацияПродукцииЭкспорт КАК алк_РеализацияПродукцииЭкспорт
		|ГДЕ
		|	алк_РеализацияПродукцииЭкспорт.Ссылка = &ТекущийДокумент";
		
		РезультатШапка = Запрос.Выполнить().Выбрать();
		РезультатШапка.Следующий();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РеализацияПродукцииЭкспортЗапасы.Номенклатура КАК Номенклатура,
		|	алк_РеализацияПродукцииЭкспортЗапасы.СерийныйНомер,
		|	алк_РеализацияПродукцииЭкспортЗапасы.КоличествоПакетов КАК КоличествоПакетов,
		|	алк_РеализацияПродукцииЭкспортЗапасы.Объем КАК Объем,
		|	алк_РеализацияПродукцииЭкспортЗапасы.ОбъемТаможня КАК ОбъемТаможня,
		|	алк_РеализацияПродукцииЭкспортЗапасы.КоличествоСостав КАК КоличествоСостав,
		|	алк_РеализацияПродукцииЭкспортЗапасы.ВесНетто КАК ВесНетто,
		|	алк_РеализацияПродукцииЭкспортЗапасы.ВесБрутто КАК ВесБрутто,
		|	алк_РеализацияПродукцииЭкспортЗапасы.ОГ_ИД КАК ОГ_ИД,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК СечениеТолщинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК СечениеШиринаММ
		|ИЗ
		|	Документ.алк_РеализацияПродукцииЭкспорт.Запасы КАК алк_РеализацияПродукцииЭкспортЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_РеализацияПродукцииЭкспортЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_РеализацияПродукцииЭкспортЗапасы.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ПараметрыХарактеристик.Сорт.Порядок,
		|	ОГ_ИД,
		|	СечениеТолщинаММ,
		|	СечениеШиринаММ
		|ИТОГИ
		|	СУММА(КоличествоПакетов),
		|	СУММА(Объем),
		|	СУММА(ОбъемТаможня),
		|	СУММА(КоличествоСостав),
		|	СУММА(ВесНетто),
		|	СУММА(ВесБрутто)
		|ПО
		|	ОБЩИЕ,
		|	Номенклатура,
		|	ОГ_ИД,
		|	Порода,
		|	Сорт,
		|	Длина,
		|	СечениеТолщинаММ,
		|	СечениеШиринаММ,
		|	Влажность";
		
		
		РезультатЗапроса = Запрос.Выполнить();   //  РезультатЗапроса.Выгрузить()
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_РеализацияПродукцииЭкспорт.СпецификацияПМ_Англ");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = "SPECIFICATION № " + РезультатШапка.Номер;
		ОбластьМакета.Параметры.Заказ = РезультатШапка.ЗаказПредставление;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаОбщийИтог.Следующий();		// Общий итог
		
		ВыборкаНоменклатура = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиНоменклатуры");
			ОбластьМакета.Параметры.Заполнить(ВыборкаНоменклатура);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ВыборкаОГ_ИД = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОГ_ИД.Следующий() Цикл
				// Вставить обработку выборки ВыборкаОГ_ИД
				
				ВыборкаПорода = ВыборкаОГ_ИД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПорода.Следующий() Цикл
					
					ВыборкаСорт = ВыборкаПорода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаСорт.Следующий() Цикл
						
						ВыборкаДлина = ВыборкаСорт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаДлина.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДлина
							
							ВыборкаСечениеТолщина = ВыборкаДлина.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаСечениеТолщина.Следующий() Цикл
								// Вставить обработку выборки ВыборкаСечение
								
								ВыборкаСечениеШирина = ВыборкаСечениеТолщина.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ВыборкаСечениеШирина.Следующий() Цикл
									
									ВыборкаВлажность = ВыборкаСечениеШирина.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									Пока ВыборкаВлажность.Следующий() Цикл
										
										ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
										ОбластьМакета.Параметры.Заполнить(ВыборкаВлажность);
										ТабличныйДокумент.Вывести(ОбластьМакета);
										
										ВыборкаДетальныеЗаписи = ВыборкаВлажность.Выбрать();
										
										Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
											// Вставить обработку выборки ВыборкаДетальныеЗаписи
										КонецЦикла;
									КонецЦикла;
								КонецЦикла; 
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиГруппы");
				ОбластьМакета.Параметры.Заполнить(ВыборкаОГ_ИД);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
		ОбластьМакета.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецПроцедуры //СформироватьСпецификацияАнгл()
	
	// Процедура формирования печатной формы "Спецификация на английском 2"
	//
	Процедура СформироватьСпецификацияАнгл_2(ТабличныйДокумент, ТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Запрос.Текст = "";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_РеализацияПродукцииЭкспорт.СпецификацияПМ_Англ_2");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		//ОбластьМакета.Параметры.Заполнить(ВыборкаОГ_ИД);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецПроцедуры //СформироватьСпецификацияАнгл_2()
	
	#КонецОбласти	
	
	
#КонецЕсли
